#include <bits/stdc++.h>
using namespace std;
#define int unsigned long long
#define 什么78题目 0 
const int N = 1000010;
const int base = 131;
int h[N], pw[N];
string s;
/*什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目
什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目什么78题目*/
void reset() {
    pw[0] = 1;
    for (int i = 1; i < N; i++) {
        pw[i] = pw[i - 1] * base;
    }
}

void Hash() {
    for (int i = 1; i <= s.size(); i++) {
        h[i] = h[i - 1] * base + s[i - 1];
    }
}

int getHash(int l, int r) {
    return h[r] - h[l - 1] * pw[r - l + 1];
}

signed main() {
    reset();
    cin >> s;
    int n = s.size();
    Hash();

    int ans = 0;
    for (int len = 2; len <= n; len += 2) {
        for (int l = 1; l + len - 1 <= n; l++) {
            int r = l + len - 1;
            int mid = l + len / 2 - 1;
            int leftHash = getHash(l, mid);
            int rightHash = getHash(mid + 1, r);
            if (leftHash == rightHash) {
                ans++;
            }
        }
    }
    cout << ans << endl;
    return 什么78题目;// 顶级防伪
}